app/Controllers/Kelalaian.php

SELECT COUNT(*) AS `numrows`
FROM `tb_detail_kelalaian`
JOIN `tb_karyawan` ON `idkaryawan`=`idkaryawan_kelalain`
WHERE MONTH(tgl_kelalaian) = '07'
AND YEAR(tgl_kelalaian) = '2023'
SELECT *
FROM `tb_kelalaian`
JOIN `tb_karyawan` ON `idkaryawan`=`id_karyawan`
WHERE MONTH(tgl) = '07'
AND YEAR(tgl) = '2023'
ORDER BY `tgl` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tb_kelalaian`
JOIN `tb_karyawan` ON `idkaryawan`=`id_karyawan`
WHERE MONTH(tgl) = '07'
AND YEAR(tgl) = '2023'
SELECT *
FROM `tb_detail_kelalaian`
JOIN `tb_karyawan` ON `idkaryawan`=`idkaryawan_kelalain`
WHERE MONTH(tgl_kelalaian) = '07'
AND YEAR(tgl_kelalaian) = '2023'
ORDER BY `tgl_Kelalaian` DESC
---
    public function dataperbulan()
    {


        $tombolcari = $this->request->getPost('tombolcari');
        $bulanini = date('m');
        $tahunini = date('Y');

        if (isset($tombolcari)) {
            $bulan = $this->request->getPost('bulan');
            $tahun = $this->request->getPost('tahun');
            session()->set('bulan', $bulan);
            redirect()->to('Kelalaian/dataKelalaianperbulan');
        } else {
            $bulan = $bulanini;
            $tahun = $tahunini;
        }

        $totaldata = $bulan ? $this->DetailKelalaian->cari_berdasarkan_bln_thn($bulan, $tahun)->countAllResults() : $this->DetailKelalaian->cari_berdasarkan_bln_thn($bulanini, $tahun)->countAllResults();
        $dataKelalaian = $bulan ? $this->Kelalaian->cari_berdasarkan_bln_thn($bulan, $tahun)->OrderBy('tgl', 'desc')->paginate(10, 'nomor') : $this->Kelalaian->cari_berdasarkan_bln_thn($bulanini, $tahunini)->OrderBy('tgl', 'desc')->paginate(10, 'nomor');
        $datadetailKelalaian = $bulan ? $this->DetailKelalaian->cari_berdasarkan_bln_thn($bulan, $tahun)->OrderBy('tgl_Kelalaian', 'desc')->findall() : $this->DetailKelalaian->cari_berdasarkan_bln_thn($bulanini, $tahunini)->OrderBy('tgl_Kelalaian', 'desc')->findall();